<?php
$perfum = [
    'Туалетная_вода' =>[
        [
            'Название' => 'Диор',
            'Цена' => '150_Есть',
            'Наличие' => 'Есть'
        ],
        [
            'Название' => 'Д&Г',
            'Цена' => '130_Есть',
            'Наличие' => 'Есть'
        ],
        [
            'Название' => 'Эмпорио_армани',
            'Цена' => '180_Нету',
            'Наличие' => 'Нет'
        ],
    ],


    'Парфюмерная_вода' =>[
        [
            'Название' => 'Диор',
            'Цена' => '290_Есть',
            'Наличие' => 'Есть'
        ],
        [
            'Название' => 'Живенши',
            'Цена' => '343_Нету',
            'Наличие' => 'Нет'
        ],
        [
            'Название' => 'Антонио_бандерос',
            'Цена' => '195_Нету',
            'Наличие' => 'Нет'
        ],
    ],

    'Колонь' =>[
        [
            'Название' => 'Диор',
            'Цена' => '220_Есть',
            'Наличие' => 'Есть'
        ],
        ['Название' => 'Сэн_лоран',
            'Цена' => '400_Нету',
            'Наличие' => 'Нет'
        ],
        [
            'Название' => 'Блэк_афгано',
            'Цена' => '666_Есть',
            'Наличие' => 'Есть'
        ],
    ],
];
foreach ($perfum as $category => $perfumer) {
    echo($category);
    echo(':');
    echo('<br>');
    foreach ($perfumer as $key => $perfume) {
        if($perfume['Наличие'] == 'Есть'){
            echo ($perfume['Название']);
            echo(' ');
            echo($perfume['Цена']);
            echo(' ');
            echo('<br>');
        }
    }
    echo('<br>');
}
